In [84]:
# 25-07-25, Friday;
# IMDB movies analysis.
import pandas as pd
import numpy as np

### Problem statement:
<!-- We're using directors and movies csv files from Code. -->

In [85]:
# Importing movies.csv:
movies = pd.read_csv(r"C:\Data Analytics Json\Python\Code\movies.csv")

In [86]:
movies.head()

,Unnamed: 0,id,budget,popularity,revenue,title,vote_average,vote_count,director_id,year,month,day
0,0,43597,237000000,150,2787965087,Avatar,7.2,11800,4762,2009,Dec,Thursday
1,1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,4763,2007,May,Saturday
2,2,43599,245000000,107,880674609,Spectre,6.3,4466,4764,2015,Oct,Monday
3,3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,4765,2012,Jul,Monday
4,5,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,4767,2007,May,Tuesday

In [87]:
# remove Unnamed: 0
movies.drop("Unnamed: 0", axis = 1, inplace = True)
movies.head()

,id,budget,popularity,revenue,title,vote_average,vote_count,director_id,year,month,day
0,43597,237000000,150,2787965087,Avatar,7.2,11800,4762,2009,Dec,Thursday
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,4763,2007,May,Saturday
2,43599,245000000,107,880674609,Spectre,6.3,4466,4764,2015,Oct,Monday
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,4765,2012,Jul,Monday
4,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,4767,2007,May,Tuesday

In [88]:
movies.shape

(1465, 11)

In [89]:
# checking for duplicates.
movies["id"].nunique()

1465

In [90]:
movies["director_id"].nunique()

199

In [91]:
# Importing directors.csv:
directors = pd.read_csv(r"C:\Data Analytics Json\Python\Code\directors.csv")
directors.head()

   Unnamed: 0      director_name    id gender
0           0      James Cameron  4762   Male
1           1     Gore Verbinski  4763   Male
2           2         Sam Mendes  4764   Male
3           3  Christopher Nolan  4765   Male
4           4     Andrew Stanton  4766   Male

In [92]:
# remove Unnamed: 0
directors.drop("Unnamed: 0", axis = 1, inplace = True)

In [93]:
directors.head()

       director_name    id gender
0      James Cameron  4762   Male
1     Gore Verbinski  4763   Male
2         Sam Mendes  4764   Male
3  Christopher Nolan  4765   Male
4     Andrew Stanton  4766   Male

In [94]:
directors["id"].nunique()

2349

In [95]:
np.all((movies["director_id"].isin(directors["id"])))

np.True_

In [96]:
# final df:
df = movies.merge(directors, how = "left", left_on = "director_id", right_on = "id")

In [97]:
df.head()

,id_x,budget,popularity,revenue,title,vote_average,vote_count,director_id,year,month,day,director_name,id_y,gender
0,43597,237000000,150,2787965087,Avatar,7.2,11800,4762,2009,Dec,Thursday,James Cameron,4762,Male
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,4763,2007,May,Saturday,Gore Verbinski,4763,Male
2,43599,245000000,107,880674609,Spectre,6.3,4466,4764,2015,Oct,Monday,Sam Mendes,4764,Male
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,4765,2012,Jul,Monday,Christopher Nolan,4765,Male
4,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,4767,2007,May,Tuesday,Sam Raimi,4767,Male

In [98]:
df.drop(["director_id", "id_y"], axis = 1, inplace = True)

In [99]:
df.head()

,id_x,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,43597,237000000,150,2787965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,Male
2,43599,245000000,107,880674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,Male
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male
4,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,Male

In [100]:
df.rename({"id_x" : "movie_id"}, axis = 1, inplace = True)

In [101]:
df.head()

,movie_id,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,43597,237000000,150,2787965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,Male
2,43599,245000000,107,880674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,Male
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male
4,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,Male

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1465 entries, 0 to 1464
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       1465 non-null   int64
 1   budget         1465 non-null   int64
 2   popularity     1465 non-null   int64
 3   revenue        1465 non-null   int64
 4   title          1465 non-null   object
 5   vote_average   1465 non-null   float64
 6   vote_count     1465 non-null   int64
 7   year           1465 non-null   int64
 8   month          1465 non-null   object
 9   day            1465 non-null   object
 10  director_name  1465 non-null   object
 11  gender         1341 non-null   object
dtypes: float64(1), int64(6), object(5)
memory usage: 137.5+ KB

In [103]:
df.describe()

,movie_id,budget,popularity,revenue,vote_average,vote_count,year
count,1465.000000,1.465000e+03,1465.000000,1.465000e+03,1465.000000,1465.000000,1465.000000
mean,45225.191126,4.802295e+07,30.855973,1.432539e+08,6.368191,1146.396587,2002.615017
std,1189.096396,4.935541e+07,34.845214,2.064918e+08,0.818033,1578.077438,8.680141
min,43597.000000,0.000000e+00,0.000000,0.000000e+00,3.000000,1.000000,1976.000000
25%,44236.000000,1.400000e+07,11.000000,1.738013e+07,5.900000,216.000000,1998.000000
50%,45022.000000,3.300000e+07,23.000000,7.578164e+07,6.400000,571.000000,2004.000000
75%,45990.000000,6.600000e+07,41.000000,1.792469e+08,6.900000,1387.000000,2009.000000
max,48395.000000,3.800000e+08,724.000000,2.787965e+09,8.300000,13752.000000,2016.000000

In [104]:
df[df["revenue"] == 0]

,movie_id,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
271,44050,0,25,0,The Pink Panther,5.6,550,2006,Jan,Wednesday,Shawn Levy,Male
314,44133,75000000,13,0,Anna and the King,6.4,197,1999,Dec,Thursday,Andy Tennant,Male
341,44181,0,13,0,Wolf,6.0,216,1994,Jun,Friday,Mike Nichols,Male
351,44198,0,9,0,Rollerball,3.4,106,2002,Feb,Friday,John McTiernan,NaN
374,44245,65000000,19,0,Mona Lisa Smile,6.5,393,2003,Dec,Friday,Mike Newell,Male
...,...,...,...,...,...,...,...,...,...,...,...,...
1453,48294,0,6,0,She's Gotta Have It,6.1,25,1986,Aug,Friday,Spike Lee,Male
1457,48323,0,5,0,The Mighty,7.1,51,1998,Oct,Friday,Peter Chelsom,Male
1459,48359,0,2,0,George Washington,6.4,36,2000,Oct,Sunday,David Gordon Green,Male
1462,48375,0,7,0,Rampage,6.0,131,2009,Aug,Friday,Uwe Boll,Male
1463,48376,0,3,0,Slacker,6.4,77,1990,Jul,Friday,Richard Linklater,Male

In [105]:
df.describe(include = "object")

              title month     day     director_name gender
count          1465  1465    1465              1465   1341
unique         1465    12       7               199      2
top     El Mariachi   Dec  Friday  Steven Spielberg   Male
freq              1   193     654                26   1309

In [106]:
df["director_name"].value_counts().head(10)

director_name
Steven Spielberg     26
Martin Scorsese      19
Clint Eastwood       19
Woody Allen          18
Spike Lee            16
Robert Rodriguez     16
Ridley Scott         16
Renny Harlin         15
Steven Soderbergh    15
Tim Burton           14
Name: count, dtype: int64

In [107]:
df["director_name"].value_counts().tail(10)

director_name
Stephen Daldry         5
Gavin O'Connor         5
Mira Nair              5
Sidney Lumet           5
Miguel Arteta          5
Mike Leigh             5
Brad Anderson          5
Michael Polish         5
Darren Lynn Bousman    5
Nicole Holofcener      5
Name: count, dtype: int64

In [108]:
df["revenue"] = (df["revenue"]/ 1000000).round(2)
df["budget"] = (df["budget"]/ 1000000).round(2)

In [109]:
df.head()

,movie_id,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,43597,237.0,150,2787.97,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male
1,43598,300.0,139,961.00,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,Male
2,43599,245.0,107,880.67,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,Male
3,43600,250.0,112,1084.94,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male
4,43602,258.0,115,890.87,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,Male

In [110]:
df["profit_margin"] = df["revenue"] - df["budget"]
df["prft_mrgn_per"] = (df["profit_margin"]) / df["revenue"] * 100
df.head()

,movie_id,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender,profit_margin,prft_mrgn_per
0,43597,237.0,150,2787.97,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male,2550.97,91.499191
1,43598,300.0,139,961.00,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,Male,661.00,68.782518
2,43599,245.0,107,880.67,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,Male,635.67,72.180272
3,43600,250.0,112,1084.94,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male,834.94,76.957251
4,43602,258.0,115,890.87,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,Male,632.87,71.039546

In [114]:
df = df[~(df["revenue"] == 0) | (df["budget"] == 0)] # ~ negation.

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1375 entries, 0 to 1464
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       1375 non-null   int64
 1   budget         1375 non-null   float64
 2   popularity     1375 non-null   int64
 3   revenue        1375 non-null   float64
 4   title          1375 non-null   object
 5   vote_average   1375 non-null   float64
 6   vote_count     1375 non-null   int64
 7   year           1375 non-null   int64
 8   month          1375 non-null   object
 9   day            1375 non-null   object
 10  director_name  1375 non-null   object
 11  gender         1261 non-null   object
 12  profit_margin  1375 non-null   float64
 13  prft_mrgn_per  1269 non-null   float64
dtypes: float64(5), int64(4), object(5)
memory usage: 161.1+ KB